<?php
namespace App\Service;

class SpamFilter
{
    public function filterText( $text) {
        if (empty($text)) {
            return 'empty_text';
        }
        if (strlen($text) < 7) {
            return 'small_len_text';
        }

        $signatures = [
            "http",
            "vk.cc",
            "групп",
            "@",
            "девочк",
            "девушк",
            "денег",
            "деньг",
            "женщин",
            "жиrало",
            "жигало",
            "заходи",
            "канал",
            "клуб",
            "купай",
            "купи",
            "магазин",
            "обеспеч",
            "оценкапопы",
            "оценкачлена",
            "паблик",
            "переходи",
            "плата",
            "плач",
            "приобрет",
            "приобрит",
            "прода",
            "проститу",
            "работ",
            "регестри",
            "регистри",
            "сайт",
            "содерж",
            "сообщество",
            '$',
            '₽',
            '[',
            'бабки',
            'билет',
            'вознаграждение',
            'вознагрождение',
            'деньги',
            'заплачу',
            'материальную',
            'награда',
            'переезд',
            'прода',
            'поддержку',
            'поддержу',
            'поддершку',
            'подержку',
            'подержу',
            'подершку',
            'попперс',
            'поперс',
            'мп ',
            'МП',
            'м.п.',
            ' мп',
            '500',
            '1000',
            '1500',
            '2000',
            '2500',
            '3000',
            '3500',
            '4000',
            '5000',
            '10000',
            '50000',
            '60000',
            '70000',
            '80000',
            '100000'
        ];

        foreach ($signatures as $s) {
            if (strpos(strtolower($text), $s) !== false) {
                return $s;
            }
        }
        return false;
    }
    public function filterPost(array $post)
    {
        if (strval($post['from_id'])[0]  === '-' ){
            return 'groupPoster';
        }
        if ( ($post['date'] + (60 * 60 * 2.3)) < time()) {
            return 'old_date';
        }

        return $this->filterText($post['text']);
    }

}



